Learning to Rank
----------------
##排序模型
现有的排序模型主要可以分为以下两类：相关度排序模型和重要性排序模型

###相关度排序模型
主要是根据查询和文档的相似度来排序。主要的模型有以下几种：布尔模型、向量空间模型VSM， 隐语义模型LSA、LDA, BM25, LMIR等。

###重要性排序模型
不考虑查询，根据文档之间的结构来判断文档的权威程度，常用的模型有：PageRank, HITS，HillTop,
TrustRank等。

##Why use LTR
单个模型往往达不到要求，通过组合多个模型来构成一个更好的模型。...

LTR考虑的给定查询下的文档的排序。因此LTR用到的特征主要包括：文档自身的特征，文档与查询的相似度，文档的Pagerank值等。也就是说，我们可以使用相相关性排序模型和重要性排序模型的输出作为LTR的特征。

###Data Labeling
两种方法获取训练数据：  
1. 人工标注。首先从搜索引擎的搜索记录中随机抽取一些查询，将这些查询提交给多个不同的搜索引擎，然后选取各个搜索引擎返回结果的前K个，最后人工对结果进行标注，有五个层次：perfect, excellent, good, fair, and bad.
2. 日志挖掘。 利用搜索引擎的日志记录提取LTR的训练数据。 Joachims给出了一种方法：给定一个查询，搜索引擎返回的结果列表为L，用户点击的文档的集合为C，如果一个文档$d_i$被点击过，另外一个文档$d_j$没有被点击过，并且$d_j$在结果列表中排在$d_i$之前，则$d_i>d_j$就是一条训练记录。亦即训练数据为：{di>dj|di属于C，dj属于L-C，p(dj)<p(di)}，其中p(d)表示文档d在查询结果列表中的位置，越小表示越靠前。
